STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231dxx_cm33.h
/*
 * @brief EXTI Block description (EXTI)
 * c7amba_exti_v3-0_UserSpec_v3_0_0m *
 */
typedef struct
{
  __IO uint32_t RTSR1;           /*!< EXTI rising trigger selection register        Address offset: 0x000 */
  __IO uint32_t FTSR1;           /*!< EXTI falling trigger selection register       Address offset: 0x004 */
  __IO uint32_t SWIER1;          /*!< EXTI software interrupt event register        Address offset: 0x008 */
  __IO uint32_t RPR1;            /*!< EXTI rising edge pending register             Address offset: 0x00C */
  __IO uint32_t FPR1;            /*!< EXTI falling edge pending register            Address offset: 0x010 */
  __IO uint32_t SECCFGR1;        /*!< EXTI security configuration register          Address offset: 0x014 */
  __IO uint32_t PRIVCFGR1;       /*!< EXTI Privilege configuration register         Address offset: 0x018 */
       uint32_t RESERVED0;       /*!< Reserved                                      Address offset: 0x01C */
  __IO uint32_t RTSR2;           /*!< EXTI rising trigger selection register        Address offset: 0x020 */
  __IO uint32_t FTSR2;           /*!< EXTI falling trigger selection register       Address offset: 0x024 */
  __IO uint32_t SWIER2;          /*!< EXTI software interrupt event register        Address offset: 0x028 */
  __IO uint32_t RPR2;            /*!< EXTI rising edge pending register             Address offset: 0x02C */
  __IO uint32_t FPR2;            /*!< EXTI falling edge pending register            Address offset: 0x030 */
  __IO uint32_t SECCFGR2;        /*!< EXTI security enable register                 Address offset: 0x034 */
  __IO uint32_t PRIVCFGR2;       /*!< EXTI Privilege enable register                Address offset: 0x038 */
       uint32_t RESERVED1;       /*!< Reserved                                       Address offset: 0x03C */
  __IO uint32_t RTSR3;           /*!< EXTI rising trigger selection register        Address offset: 0x040 */
  __IO uint32_t FTSR3;           /*!< EXTI falling trigger selection register       Address offset: 0x044 */
  __IO uint32_t SWIER3;          /*!< EXTI software interrupt event register        Address offset: 0x048 */
  __IO uint32_t RPR3;            /*!< EXTI rising edge pending register             Address offset: 0x04C */
  __IO uint32_t FPR3;            /*!< EXTI falling edge pending register            Address offset: 0x050 */
  __IO uint32_t SECCFGR3;        /*!< EXTI security enable register                 Address offset: 0x054 */
  __IO uint32_t PRIVCFGR3;       /*!< EXTI Privilege enable register                Address offset: 0x058 */
       uint32_t RESERVED15;      /*!< Reserved                                       Address offset: 0x05C */
  __IO uint32_t EXTICR[4];       /*!< EXTI external interrupt selection register 1  Address offset: 0x060-0x6C */
  __IO uint32_t LOCKR;           /*!< EXTI lock register                            Address offset: 0x070 */
       uint32_t RESERVED3[3];    /*!< Reserved                                       Address offset: 0x074-0x07C */
  __IO uint32_t C1IMR1;          /*!< EXTI CPU1 wakeup with interrupt mask register Address offset: 0x080 */
       uint32_t RESERVED17[3];   /*!< Reserved                                       Address offset: 0x088-0x08C */
  __IO uint32_t C1IMR2;          /*!< EXTI CPU1 wakeup with interrupt mask register Address offset: 0x090 */
       uint32_t RESERVED18[3];   /*!< Reserved                                       Address offset: 0x098-0x09C */
  __IO uint32_t C1IMR3;          /*!< EXTI CPU1 wakeup with interrupt mask register Address offset: 0x0A0 */
       uint32_t RESERVED6[7];    /*!< Reserved                                       Address offset: 0x0A8-0x0BC */
  __IO uint32_t C2IMR1;          /*!< EXTI CPU2 wakeup with interrupt mask register Address offset: 0x0C0 */
  __IO uint32_t C2EMR1;          /*!< EXTI CPU2 wakeup with event mask register     Address offset: 0x0C4 */
       uint32_t RESERVED20[2];   /*!< Reserved                                       Address offset: 0x0C8-0x0CC */
  __IO uint32_t C2IMR2;          /*!< EXTI CPU2 wakeup with interrupt mask register Address offset: 0x0D0 */
  __IO uint32_t C2EMR2;          /*!< EXTI CPU2 wakeup with event mask register     Address offset: 0x0D4 */
       uint32_t RESERVED21[2];   /*!< Reserved                                       Address offset: 0x0D8-0x0DC */
  __IO uint32_t C2IMR3;          /*!< EXTI CPU2 wakeup with interrupt mask register Address offset: 0x0E0 */
  __IO uint32_t C2EMR3;          /*!< EXTI CPU2 wakeup with event mask register     Address offset: 0x0E4 */
         uint32_t RESERVED22[6];   /*!< Reserved                                       Address offset: 0x0E8-0x0FC */
  __IO uint32_t C3IMR1;          /*!< EXTI CPU3 wakeup with interrupt mask register Address offset: 0x100 */
  __IO uint32_t C3EMR1;          /*!< EXTI CPU3 wakeup with event mask register     Address offset: 0x104 */
       uint32_t RESERVED23[2];   /*!< Reserved                                       Address offset: 0x108-0x10C */
  __IO uint32_t C3IMR2;          /*!< EXTI CPU3 wakeup with interrupt mask register Address offset: 0x110 */
  __IO uint32_t C3EMR2;          /*!< EXTI CPU3 wakeup with event mask register     Address offset: 0x114 */
       uint32_t RESERVED24[2];   /*!< Reserved                                       Address offset: 0x118-0x11C */
  __IO uint32_t C3IMR3;          /*!< EXTI CPU3 wakeup with interrupt mask register Address offset: 0x120 */
       uint32_t RESERVED25[23];  /*!< Reserved                                       Address offset: 0x124-0x17C */
  __IO uint32_t ECIDCFGR[96];    /*!< EXTI configurable event CID Config register   Address offset: 0x180-0x2BC */
  __IO uint32_t C1CIDCFGR;       /*!< EXTI processor 1 CID configuration register   Address offset: 0x300 */
  __IO uint32_t C2CIDCFGR;       /*!< EXTI processor 2 CID configuration register   Address offset: 0x304 */
  __IO uint32_t C3CIDCFGR;       /*!< EXTI processor 3 CID configuration register   Address offset: 0x308 */
       uint32_t RESERVED27[45];  /*!< Reserved                                      Address offset: 0x30C-0x3BC */
  __IO uint32_t HWCFGR13;        /*!< EXTI Hardware configuration register 13       Address offset: 0x3C0 */
  __IO uint32_t HWCFGR12;        /*!< EXTI Hardware configuration register 12       Address offset: 0x3C4 */
  __IO uint32_t HWCFGR11;        /*!< EXTI Hardware configuration register 11       Address offset: 0x3C8 */
       uint32_t RESERVED12[3];   /*!< Reserved                                      Address offset: 0x3CC-0x3D4 */
  __IO uint32_t HWCFGR7;         /*!< EXTI Hardware configuration register 7        Address offset: 0x3D8 */
  __IO uint32_t HWCFGR6;         /*!< EXTI Hardware configuration register 6        Address offset: 0x3DC */
  __IO uint32_t HWCFGR5;         /*!< EXTI Hardware configuration register 5        Address offset: 0x3E0 */
  __IO uint32_t HWCFGR4;         /*!< EXTI Hardware configuration register 4        Address offset: 0x3E4 */
  __IO uint32_t HWCFGR3;         /*!< EXTI Hardware configuration register 3        Address offset: 0x3E8 */
  __IO uint32_t HWCFGR2;         /*!< EXTI Hardware configuration register 2        Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;         /*!< EXTI Hardware configuration register 1        Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< EXTI IP Version register                      Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< EXTI Identification register                  Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< EXTI Size ID register                         Address offset: 0x3FC */
} EXTI_TypeDef;

typedef struct
{
  __IO uint32_t IMR1;                /*!< EXTI Interrupt mask register,                Address offset: 0x00 */
  __IO uint32_t EMR1;                /*!< EXTI Event mask register,                    Address offset: 0x04 */
  uint32_t      RESERVED1[2];        /*!< Reserved, offset 0x08 -> 0x10                                     */
  __IO uint32_t IMR2;                /*!< EXTI Interrupt mask register,                Address offset: 0x10 */
  __IO uint32_t EMR2;                /*!< EXTI Event mask register,                    Address offset: 0x14 */
  uint32_t      RESERVED2[2];        /*!< Reserved, offset 0x18 -> 0x20                                     */
  __IO uint32_t IMR3;                /*!< EXTI Interrupt mask register,                Address offset: 0x20 */
  __IO uint32_t EMR3;                /*!< EXTI Event mask register,                    Address offset: 0x24 */
  uint32_t      RESERVED3[6];        /*!< Reserved, offset 0x28 -> 0x40                                     */
} EXTI_Core_TypeDef;

/**
  * @brief Flexible Memory Controller
  */

typedef struct
{
  __IO uint32_t BTCR[8];    /*!< NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C */
} FMC_Bank1_TypeDef;

/**
  * @brief Flexible Memory Controller Bank1E
  */

typedef struct
{
  __IO uint32_t BWTR[7];    /*!< NOR/PSRAM write timing registers, Address offset: 0x104-0x11C */
} FMC_Bank1E_TypeDef;

/**
  * @brief Flexible Memory Controller Bank3
  */

typedef struct
{
  __IO uint32_t PCR;             /*!< NAND Flash Programmable control register               Address offset: 0x080 */
  __IO uint32_t SR;              /*!< FMC status register                                    Address offset: 0x084 */
  __IO uint32_t PMEM;            /*!< Common memory space timing register                    Address offset: 0x088 */
  __IO uint32_t PATT;            /*!< Attribute memory space timing registers                Address offset: 0x08C */
  __IO uint32_t HPR;             /*!< FMC Hamming parity result registers                    Address offset: 0x090 */
  __IO uint32_t HECCR;           /*!< FMC Hamming code ECC result register                   Address offset: 0x094 */
       uint32_t RESERVED0[58];   /*!< Reserved                                               Address offset: 0x098-0x17C */
  __IO uint32_t IER;             /*!< FMC NAND Interrupt Enable Register                     Address offset: 0x180 */
  __IO uint32_t ISR;             /*!< FMC Controller Interrupt Status Register               Address offset: 0x184 */
  __IO uint32_t ICR;             /*!< FMC NAND Controller Interrupt Clear Register           Address offset: 0x188 */
       uint32_t RESERVED1[29];   /*!< Reserved                                               Address offset: 0x18C-0x1FC */
  __IO uint32_t CSQCR;           /*!< FMC NAND Command Sequencer Control Register            Address offset: 0x200 */
  __IO uint32_t CSQCFGR1;        /*!< FMC NAND Command Sequencer Configuration Register 1    Address offset: 0x204 */
  __IO uint32_t CSQCFGR2;        /*!< FMC NAND Command Sequencer Configuration Register 2    Address offset: 0x208 */
  __IO uint32_t CSQCFGR3;        /*!< FMC NAND sequencer configuration register 3            Address offset: 0x20C */
  __IO uint32_t CSQAR1;          /*!< FMC NAND Command Sequencer Address Register 1          Address offset: 0x210 */
  __IO uint32_t CSQAR2;          /*!< FMC NAND Command Sequencer Address Register 2          Address offset: 0x214 */
       uint32_t RESERVED2[2];    /*!< Reserved                                               Address offset: 0x218-0x21C */
  __IO uint32_t CSQIER;          /*!< FMC NAND Command Sequencer Interrupt Enable Register   Address offset: 0x220 */
  __IO uint32_t CSQISR;          /*!< FMC NAND Command Sequencer Interrupt Status Register   Address offset: 0x224 */
  __IO uint32_t CSQICR;          /*!< FMC NAND Command Sequencer Interrupt Clear Register    Address offset: 0x228 */
       uint32_t RESERVED3;       /*!< Reserved                                               Address offset: 0x22C */
  __IO uint32_t CSQEMSR;         /*!< FMC Command Sequencer Error Mapping Status register    Address offset: 0x230 */
       uint32_t RESERVED4[7];    /*!< Reserved                                               Address offset: 0x234-0x24C */
  __IO uint32_t BCHIER;          /*!< FMC BCH Interrupt enable register                      Address offset: 0x250 */
  __IO uint32_t BCHISR;          /*!< FMC BCH Interrupt and Status Register                  Address offset: 0x254 */
  __IO uint32_t BCHICR;          /*!< FMC BCH Interrupt Clear Register                       Address offset: 0x258 */
       uint32_t RESERVED5;       /*!< Reserved                                               Address offset: 0x25C */
  __IO uint32_t BCHPBR1;         /*!< FMC BCH Parity Bits Register 1                         Address offset: 0x260 */
  __IO uint32_t BCHPBR2;         /*!< FMC BCH Parity Bits Register 2                         Address offset: 0x264 */
  __IO uint32_t BCHPBR3;         /*!< FMC BCH Parity Bits Register 3                         Address offset: 0x268 */
  __IO uint32_t BCHPBR4;         /*!< FMC BCH Parity Bits Register 4                         Address offset: 0x26C */
       uint32_t RESERVED6[3];    /*!< Reserved                                               Address offset: 0x270-0x278 */
  __IO uint32_t BCHDSR0;         /*!< FMC BCH Decoder Status register 0                      Address offset: 0x27C */
  __IO uint32_t BCHDSR1;         /*!< FMC BCH Decoder Status register for bank 1             Address offset: 0x280 */
  __IO uint32_t BCHDSR2;         /*!< FMC BCH Decoder Status register for bank 2             Address offset: 0x284 */
  __IO uint32_t BCHDSR3;         /*!< FMC BCH Decoder Status register for bank 3             Address offset: 0x288 */
  __IO uint32_t BCHDSR4;         /*!< FMC BCH Decoder Status register for bank 4             Address offset: 0x28C */
       uint32_t RESERVED7[28];   /*!< Reserved                                               Address offset: 0x290-0x2FC */
} FMC_Bank3_TypeDef;

/**
  * @brief Flexible Memory Controller Common
  */

