STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231dxx_cm33.h
#define HPDMA2_Channel0_S                   ((DMA_Channel_TypeDef *) HPDMA2_Channel0_BASE_S)
#define HPDMA2_Channel1_S                   ((DMA_Channel_TypeDef *) HPDMA2_Channel1_BASE_S)
#define HPDMA2_Channel2_S                   ((DMA_Channel_TypeDef *) HPDMA2_Channel2_BASE_S)
#define HPDMA2_Channel3_S                   ((DMA_Channel_TypeDef *) HPDMA2_Channel3_BASE_S)
#define HPDMA2_Channel4_S                   ((DMA_Channel_TypeDef *) HPDMA2_Channel4_BASE_S)
#define HPDMA2_Channel5_S                   ((DMA_Channel_TypeDef *) HPDMA2_Channel5_BASE_S)
#define HPDMA2_Channel6_S                   ((DMA_Channel_TypeDef *) HPDMA2_Channel6_BASE_S)
#define HPDMA2_Channel7_S                   ((DMA_Channel_TypeDef *) HPDMA2_Channel7_BASE_S)
#define HPDMA2_Channel8_S                   ((DMA_Channel_TypeDef *) HPDMA2_Channel8_BASE_S)
#define HPDMA2_Channel9_S                   ((DMA_Channel_TypeDef *) HPDMA2_Channel9_BASE_S)
#define HPDMA2_Channel10_S                  ((DMA_Channel_TypeDef *) HPDMA2_Channel10_BASE_S)
#define HPDMA2_Channel11_S                  ((DMA_Channel_TypeDef *) HPDMA2_Channel11_BASE_S)
#define HPDMA2_Channel12_S                  ((DMA_Channel_TypeDef *) HPDMA2_Channel12_BASE_S)
#define HPDMA2_Channel13_S                  ((DMA_Channel_TypeDef *) HPDMA2_Channel13_BASE_S)
#define HPDMA2_Channel14_S                  ((DMA_Channel_TypeDef *) HPDMA2_Channel14_BASE_S)
#define HPDMA2_Channel15_S                  ((DMA_Channel_TypeDef *) HPDMA2_Channel15_BASE_S)

#define HPDMA3_Channel0_S                   ((DMA_Channel_TypeDef *) HPDMA3_Channel0_BASE_S)
#define HPDMA3_Channel1_S                   ((DMA_Channel_TypeDef *) HPDMA3_Channel1_BASE_S)
#define HPDMA3_Channel2_S                   ((DMA_Channel_TypeDef *) HPDMA3_Channel2_BASE_S)
#define HPDMA3_Channel3_S                   ((DMA_Channel_TypeDef *) HPDMA3_Channel3_BASE_S)
#define HPDMA3_Channel4_S                   ((DMA_Channel_TypeDef *) HPDMA3_Channel4_BASE_S)
#define HPDMA3_Channel5_S                   ((DMA_Channel_TypeDef *) HPDMA3_Channel5_BASE_S)
#define HPDMA3_Channel6_S                   ((DMA_Channel_TypeDef *) HPDMA3_Channel6_BASE_S)
#define HPDMA3_Channel7_S                   ((DMA_Channel_TypeDef *) HPDMA3_Channel7_BASE_S)
#define HPDMA3_Channel8_S                   ((DMA_Channel_TypeDef *) HPDMA3_Channel8_BASE_S)
#define HPDMA3_Channel9_S                   ((DMA_Channel_TypeDef *) HPDMA3_Channel9_BASE_S)
#define HPDMA3_Channel10_S                  ((DMA_Channel_TypeDef *) HPDMA3_Channel10_BASE_S)
#define HPDMA3_Channel11_S                  ((DMA_Channel_TypeDef *) HPDMA3_Channel11_BASE_S)
#define HPDMA3_Channel12_S                  ((DMA_Channel_TypeDef *) HPDMA3_Channel12_BASE_S)
#define HPDMA3_Channel13_S                  ((DMA_Channel_TypeDef *) HPDMA3_Channel13_BASE_S)
#define HPDMA3_Channel14_S                  ((DMA_Channel_TypeDef *) HPDMA3_Channel14_BASE_S)
#define HPDMA3_Channel15_S                  ((DMA_Channel_TypeDef *) HPDMA3_Channel15_BASE_S)

#define HASH_S                              ((HASH_TypeDef *) HASH_BASE_S)
#define HASH_DIGEST_S                       ((HASH_DIGEST_TypeDef *) HASH_DIGEST_BASE_S)
#define RNG_S                               ((RNG_TypeDef *) RNG_BASE_S)
#define PKA_S                               ((PKA_TypeDef *) PKA_BASE_S)
#define RAMCFG_SYSRAM_S                     ((RAMCFG_TypeDef *) RAMCFG_SYSRAM_BASE_S)
#define RAMCFG_SRAM1_S                      ((RAMCFG_TypeDef *) RAMCFG_SRAM1_BASE_S)
#define RAMCFG_SRAM2_S                      ((RAMCFG_TypeDef *) RAMCFG_SRAM2_BASE_S)
#define RAMCFG_RETRAM_S                     ((RAMCFG_TypeDef *) RAMCFG_RETRAM_BASE_S)
#define RAMCFG_BKPSRAM_S                    ((RAMCFG_TypeDef *) RAMCFG_BKPSRAM_BASE_S)
#define RAMCFG_VDERAM_S                     ((RAMCFG_TypeDef *) RAMCFG_VDERAM_BASE_S)
#define RISC_S                              ((RISC_TypeDef *)        RISC_BASE_S)
#define RIMC_S                              ((RIMC_TypeDef *)        RIMC_BASE_S)
#define RIFSC_ID_S                          ((RIFSC_ID_TypeDef *)    RIFSC_ID_BASE_S)
#define IAC_S                               ((IAC_TypeDef *)         IAC_BASE_S)
#define RISAF1_S                            ((RISAF_TypeDef *)       RISAF1_BASE_S)
#define RISAF2_S                            ((RISAF_TypeDef *)       RISAF2_BASE_S)
#define RISAF4_S                            ((RISAF_TypeDef *)       RISAF4_BASE_S)
#define RISAF5_S                            ((RISAF_TypeDef *)       RISAF5_BASE_S)
#define RISAB1_S                            ((RISAB_TypeDef *)       RISAB1_BASE_S)
#define RISAB2_S                            ((RISAB_TypeDef *)       RISAB2_BASE_S)
#define RISAB3_S                            ((RISAB_TypeDef *)       RISAB3_BASE_S)
#define RISAB4_S                            ((RISAB_TypeDef *)       RISAB4_BASE_S)
#define RISAB5_S                            ((RISAB_TypeDef *)       RISAB5_BASE_S)
#define RISAB6_S                            ((RISAB_TypeDef *)       RISAB6_BASE_S)

#define BSEC_S                              ((BSEC_TypeDef *) BSEC_BASE_S)
#define IWDG1_S                             ((IWDG_TypeDef *) IWDG1_BASE_S)
#define IWDG2_S                             ((IWDG_TypeDef *) IWDG2_BASE_S)
#define IWDG3_S                             ((IWDG_TypeDef *) IWDG3_BASE_S)
#define IWDG4_S                             ((IWDG_TypeDef *) IWDG4_BASE_S)
#define WWDG1_S                             ((WWDG_TypeDef *) WWDG1_BASE_S)
#define VREFBUF_S                           ((VREFBUF_TypeDef *) VREFBUF_BASE_S)
#define DTS_S                               ((DTS_TypeDef *) DTS_BASE_S)
#define SERC_S                              ((SERC_TypeDef *) SERC_BASE_S)
#define HDP_S                               ((HDP_TypeDef *) HDP_BASE_S)

#define RCC_S                               ((RCC_TypeDef *) RCC_BASE_S)
#define PWR_S                               ((PWR_TypeDef *) PWR_BASE_S)
#define EXTI1_S                             ((EXTI_TypeDef *) EXTI1_BASE_S)
#define EXTI1_C1_S                          ((EXTI_Core_TypeDef *) EXTI1_C1_BASE_S)
#define EXTI1_C2_S                          ((EXTI_Core_TypeDef *) EXTI1_C2_BASE_S)
#define SYSCFG_S                            ((SYSCFG_TypeDef *) SYSCFG_BASE_S)
#define GPIOA_S                             ((GPIO_TypeDef *) GPIOA_BASE_S)
#define GPIOB_S                             ((GPIO_TypeDef *) GPIOB_BASE_S)
#define GPIOC_S                             ((GPIO_TypeDef *) GPIOC_BASE_S)
#define GPIOD_S                             ((GPIO_TypeDef *) GPIOD_BASE_S)
#define GPIOE_S                             ((GPIO_TypeDef *) GPIOE_BASE_S)
#define GPIOF_S                             ((GPIO_TypeDef *) GPIOF_BASE_S)
#define GPIOG_S                             ((GPIO_TypeDef *) GPIOG_BASE_S)
#define GPIOH_S                             ((GPIO_TypeDef *) GPIOH_BASE_S)
#define GPIOI_S                             ((GPIO_TypeDef *) GPIOI_BASE_S)
#define GPIOJ_S                             ((GPIO_TypeDef *) GPIOJ_BASE_S)
#define GPIOK_S                             ((GPIO_TypeDef *) GPIOK_BASE_S)

#define RTC_S                               ((RTC_TypeDef *) RTC_BASE_S)
#define TAMP_S                              ((TAMP_TypeDef *) TAMP_BASE_S)
#define SPI8_S                              ((SPI_TypeDef *) SPI8_BASE_S)
#define LPUART1_S                           ((USART_TypeDef *) LPUART1_BASE_S)
#define I2C8_S                              ((I2C_TypeDef *) I2C8_BASE_S)
#define LPTIM3_S                            ((LPTIM_TypeDef *) LPTIM3_BASE_S)
#define LPTIM4_S                            ((LPTIM_TypeDef *) LPTIM4_BASE_S)
#define LPTIM5_S                            ((LPTIM_TypeDef *) LPTIM5_BASE_S)
#define I3C4_S                              ((I3C_TypeDef *) I3C4_BASE_S)
#define IWDG5_S                             ((IWDG_TypeDef *) IWDG5_BASE_S)
#define WWDG2_S                             ((WWDG_TypeDef *) WWDG2_BASE_S)

#define GPIOZ_S                             ((GPIO_TypeDef *) GPIOZ_BASE_S)
#define LPDMA_S                             ((DMA_TypeDef *) LPDMA_BASE_S)
#define EXTI2_S                             ((EXTI_TypeDef *) EXTI2_BASE_S)
#define EXTI2_C1_S                          ((EXTI_Core_TypeDef *) EXTI2_C1_BASE_S)
#define EXTI2_C2_S                          ((EXTI_Core_TypeDef *) EXTI2_C2_BASE_S)
#define EXTI2_C3_S                          ((EXTI_Core_TypeDef *) EXTI2_C3_BASE_S)
#define HSEM_S                              ((HSEM_TypeDef *) HSEM_BASE_S)
#define HSEM_COMMON_S                       ((HSEM_Common_TypeDef *) (HSEM_BASE_S + 0x190UL))
#define IPCC2_S                             ((IPCC_TypeDef *) IPCC2_BASE_S)
#define IPCC2_C1_S                          ((IPCC_CommonTypeDef *) IPCC2_C1_BASE_S)
#define IPCC2_C2_S                          ((IPCC_CommonTypeDef *) IPCC2_C2_BASE_S)

#define LPDMA_Channel0_S                    ((DMA_Channel_TypeDef *) LPDMA_Channel0_BASE_S)
#define LPDMA_Channel1_S                    ((DMA_Channel_TypeDef *) LPDMA_Channel1_BASE_S)
#define LPDMA_Channel2_S                    ((DMA_Channel_TypeDef *) LPDMA_Channel2_BASE_S)
#define LPDMA_Channel3_S                    ((DMA_Channel_TypeDef *) LPDMA_Channel3_BASE_S)

