STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231dxx_cm33.h
/**************  Bit definition for SYSCFG_USB2PHY2CR register  ***************/
#define SYSCFG_USB2PHY2CR_RETENABLEN2_Pos                                  (0U)
#define SYSCFG_USB2PHY2CR_RETENABLEN2_Msk                                  (0x1UL << SYSCFG_USB2PHY2CR_RETENABLEN2_Pos)                                    /*!< 0x00000001 */
#define SYSCFG_USB2PHY2CR_RETENABLEN2                                      SYSCFG_USB2PHY2CR_RETENABLEN2_Msk                                              /*!< Retention mode enable (active low) */
#define SYSCFG_USB2PHY2CR_AUTORSMENB2_Pos                                  (1U)
#define SYSCFG_USB2PHY2CR_AUTORSMENB2_Msk                                  (0x1UL << SYSCFG_USB2PHY2CR_AUTORSMENB2_Pos)                                    /*!< 0x00000002 */
#define SYSCFG_USB2PHY2CR_AUTORSMENB2                                      SYSCFG_USB2PHY2CR_AUTORSMENB2_Msk                                              /*!< Auto-resume mode enable */
#define SYSCFG_USB2PHY2CR_USB2PHY2CMN_Pos                                  (2U)
#define SYSCFG_USB2PHY2CR_USB2PHY2CMN_Msk                                  (0x1UL << SYSCFG_USB2PHY2CR_USB2PHY2CMN_Pos)                                    /*!< 0x00000004 */
#define SYSCFG_USB2PHY2CR_USB2PHY2CMN                                      SYSCFG_USB2PHY2CR_USB2PHY2CMN_Msk                                              /*!< Controls the power down of analog blocks during Suspend and Sleep */
#define SYSCFG_USB2PHY2CR_VBUSVALID_Pos                                    (4U)
#define SYSCFG_USB2PHY2CR_VBUSVALID_Msk                                    (0x1UL << SYSCFG_USB2PHY2CR_VBUSVALID_Pos)                                      /*!< 0x00000010 */
#define SYSCFG_USB2PHY2CR_VBUSVALID                                        SYSCFG_USB2PHY2CR_VBUSVALID_Msk                                                /*!< Controls vbus valid input of USB3DR controller when in Host mode */
#define SYSCFG_USB2PHY2CR_VBUSVLDEXTSEL_Pos                                (5U)
#define SYSCFG_USB2PHY2CR_VBUSVLDEXTSEL_Msk                                (0x1UL << SYSCFG_USB2PHY2CR_VBUSVLDEXTSEL_Pos)                                  /*!< 0x00000020 */
#define SYSCFG_USB2PHY2CR_VBUSVLDEXTSEL                                    SYSCFG_USB2PHY2CR_VBUSVLDEXTSEL_Msk                                            /*!< Selects VBUS valid comparator that is used when USB3DR controller is in Device mode */
#define SYSCFG_USB2PHY2CR_VBUSVLDEXT_Pos                                   (6U)
#define SYSCFG_USB2PHY2CR_VBUSVLDEXT_Msk                                   (0x1UL << SYSCFG_USB2PHY2CR_VBUSVLDEXT_Pos)                                     /*!< 0x00000040 */
#define SYSCFG_USB2PHY2CR_VBUSVLDEXT                                       SYSCFG_USB2PHY2CR_VBUSVLDEXT_Msk                                               /*!< Voltage comparison result when an external voltage comparator is used */
#define SYSCFG_USB2PHY2CR_FILTER_BYPASS_Pos                                (7U)
#define SYSCFG_USB2PHY2CR_FILTER_BYPASS_Msk                                (0xFUL << SYSCFG_USB2PHY2CR_FILTER_BYPASS_Pos)                                  /*!< 0x00000780 */
#define SYSCFG_USB2PHY2CR_FILTER_BYPASS                                    SYSCFG_USB2PHY2CR_FILTER_BYPASS_Msk                                            /*!< Internal debounce logic is enabled (default) */
#define SYSCFG_USB2PHY2CR_USB2PHY2SEL_Pos                                  (12U)
#define SYSCFG_USB2PHY2CR_USB2PHY2SEL_Msk                                  (0x7UL << SYSCFG_USB2PHY2CR_USB2PHY2SEL_Pos)                                    /*!< 0x00007000 */
#define SYSCFG_USB2PHY2CR_USB2PHY2SEL                                      SYSCFG_USB2PHY2CR_USB2PHY2SEL_Msk                                              /*!< PHY refclk speed setting: */
#define SYSCFG_USB2PHY2CR_OTGDISABLE0_Pos                                  (16U)
#define SYSCFG_USB2PHY2CR_OTGDISABLE0_Msk                                  (0x1UL << SYSCFG_USB2PHY2CR_OTGDISABLE0_Pos)                                    /*!< 0x00010000 */
#define SYSCFG_USB2PHY2CR_OTGDISABLE0                                      SYSCFG_USB2PHY2CR_OTGDISABLE0_Msk                                              /*!< Disable control bit for the VBUS Valid comparator in USB2PHY2 */
#define SYSCFG_USB2PHY2CR_DRVVBUS0_Pos                                     (17U)
#define SYSCFG_USB2PHY2CR_DRVVBUS0_Msk                                     (0x1UL << SYSCFG_USB2PHY2CR_DRVVBUS0_Pos)                                       /*!< 0x00020000 */
#define SYSCFG_USB2PHY2CR_DRVVBUS0                                         SYSCFG_USB2PHY2CR_DRVVBUS0_Msk                                                 /*!< Control bit for the VBUS Valid comparator in USB2PHY2 */

/************  Bit definition for SYSCFG_USB2PHY2TRIM1CR register  ************/
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLITUNE_Pos                        (0U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLITUNE_Msk                        (0x3UL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLITUNE_Pos)                          /*!< 0x00000003 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLITUNE                            SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLITUNE_Msk                                    /*!< PLL Integral Path Tune */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLPTUNE_Pos                        (2U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLPTUNE_Msk                        (0xFUL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLPTUNE_Pos)                          /*!< 0x0000003C */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLPTUNE                            SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLPTUNE_Msk                                    /*!< PLL Proportional Path Tune */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2COMPDISTUNE_Pos                     (6U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2COMPDISTUNE_Msk                     (0x7UL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2COMPDISTUNE_Pos)                       /*!< 0x000001C0 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2COMPDISTUNE                         SYSCFG_USB2PHY2TRIM1CR_USB2PHY2COMPDISTUNE_Msk                                 /*!< Disconnect Threshold Adjustment */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2SQRXTUNE_Pos                        (9U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2SQRXTUNE_Msk                        (0x7UL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2SQRXTUNE_Pos)                          /*!< 0x00000E00 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2SQRXTUNE                            SYSCFG_USB2PHY2TRIM1CR_USB2PHY2SQRXTUNE_Msk                                    /*!< Squelch Threshold Adjustment */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2VDATREFTUNE_Pos                     (12U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2VDATREFTUNE_Msk                     (0x3UL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2VDATREFTUNE_Pos)                       /*!< 0x00003000 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2VDATREFTUNE                         SYSCFG_USB2PHY2TRIM1CR_USB2PHY2VDATREFTUNE_Msk                                 /*!< Data Detect Voltage Adjustment */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2OTGTUNE_Pos                         (14U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2OTGTUNE_Msk                         (0x7UL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2OTGTUNE_Pos)                           /*!< 0x0001C000 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2OTGTUNE                             SYSCFG_USB2PHY2TRIM1CR_USB2PHY2OTGTUNE_Msk                                     /*!< VBUS Valid Threshold Adjustment */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXHSXVTUNE_Pos                      (17U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXHSXVTUNE_Msk                      (0x3UL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXHSXVTUNE_Pos)                        /*!< 0x00060000 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXHSXVTUNE                          SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXHSXVTUNE_Msk                                  /*!< Transmitter High Speed Crossover Adjustment */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXFSLSTUNE_Pos                      (19U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXFSLSTUNE_Msk                      (0xFUL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXFSLSTUNE_Pos)                        /*!< 0x00780000 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXFSLSTUNE                          SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXFSLSTUNE_Msk                                  /*!< FS/LS Source Impedance Adjustment */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXVREFTUNE_Pos                      (23U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXVREFTUNE_Msk                      (0xFUL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXVREFTUNE_Pos)                        /*!< 0x07800000 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXVREFTUNE                          SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXVREFTUNE_Msk                                  /*!< HS DC Voltage Level Adjustment */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRISETUNE_Pos                      (27U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRISETUNE_Msk                      (0x3UL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRISETUNE_Pos)                        /*!< 0x18000000 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRISETUNE                          SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRISETUNE_Msk                                  /*!< HS Transmitter Rise/Fall Time Adjustment */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRESTUNE_Pos                       (29U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRESTUNE_Msk                       (0x3UL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRESTUNE_Pos)                         /*!< 0x60000000 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRESTUNE                           SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRESTUNE_Msk                                   /*!< USB Source Impedance Adjustment */

/************  Bit definition for SYSCFG_USB2PHY2TRIM2CR register  ************/
#define SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPAMPTUNE_Pos                 (0U)
#define SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPAMPTUNE_Msk                 (0x3UL << SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPAMPTUNE_Pos)                   /*!< 0x00000003 */
#define SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPAMPTUNE                     SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPAMPTUNE_Msk                             /*!< HS Transmitter Pre Emphasis Current Control */
#define SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPPULSETUNE_Pos               (2U)
#define SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPPULSETUNE_Msk               (0x1UL << SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPPULSETUNE_Pos)                 /*!< 0x00000004 */
#define SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPPULSETUNE                   SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPPULSETUNE_Msk                           /*!< HS Transmitter Pre Emphasis Duration Control */

/**************  Bit definition for SYSCFG_OCTOSPIAMCR register  **************/
#define SYSCFG_OCTOSPIAMCR_OCTOSPI_ADDRESS_MAPPING_Pos                     (0U)
#define SYSCFG_OCTOSPIAMCR_OCTOSPI_ADDRESS_MAPPING_Msk                     (0x7UL << SYSCFG_OCTOSPIAMCR_OCTOSPI_ADDRESS_MAPPING_Pos)                       /*!< 0x00000007 */
#define SYSCFG_OCTOSPIAMCR_OCTOSPI_ADDRESS_MAPPING                         SYSCFG_OCTOSPIAMCR_OCTOSPI_ADDRESS_MAPPING_Msk                                 /*!< OCTOSPI1 and OCTOSPI2 address mapping */

/****************  Bit definition for SYSCFG_ETH1CR register  *****************/
#define SYSCFG_ETH1CR_ETH1_REF_CLK_SEL_Pos                                 (0U)
#define SYSCFG_ETH1CR_ETH1_REF_CLK_SEL_Msk                                 (0x1UL << SYSCFG_ETH1CR_ETH1_REF_CLK_SEL_Pos)                                   /*!< 0x00000001 */
#define SYSCFG_ETH1CR_ETH1_REF_CLK_SEL                                     SYSCFG_ETH1CR_ETH1_REF_CLK_SEL_Msk                                             /*!< Ethernet reference / RX clock selection */
#define SYSCFG_ETH1CR_ETH1_CLK_SEL_Pos                                     (1U)
#define SYSCFG_ETH1CR_ETH1_CLK_SEL_Msk                                     (0x1UL << SYSCFG_ETH1CR_ETH1_CLK_SEL_Pos)                                       /*!< 0x00000002 */
#define SYSCFG_ETH1CR_ETH1_CLK_SEL                                         SYSCFG_ETH1CR_ETH1_CLK_SEL_Msk                                                 /*!< RGMII 125MHz clock selection */
#define SYSCFG_ETH1CR_ETH1_PTP_CLK_SEL_Pos                                 (2U)
#define SYSCFG_ETH1CR_ETH1_PTP_CLK_SEL_Msk                                 (0x1UL << SYSCFG_ETH1CR_ETH1_PTP_CLK_SEL_Pos)                                   /*!< 0x00000004 */
#define SYSCFG_ETH1CR_ETH1_PTP_CLK_SEL                                     SYSCFG_ETH1CR_ETH1_PTP_CLK_SEL_Msk                                             /*!< PTP (IEEE1588) clock selection */
#define SYSCFG_ETH1CR_ETH1_SEL_Pos                                         (4U)
#define SYSCFG_ETH1CR_ETH1_SEL_Msk                                         (0x7UL << SYSCFG_ETH1CR_ETH1_SEL_Pos)                                           /*!< 0x00000070 */
#define SYSCFG_ETH1CR_ETH1_SEL                                             SYSCFG_ETH1CR_ETH1_SEL_Msk                                                     /*!< Ethernet 1 PHY interface selection */

/****************  Bit definition for SYSCFG_ETH1SR register  *****************/
#define SYSCFG_ETH1SR_ETH1_TX_CLK_GATING_CTRL_Pos                          (0U)
#define SYSCFG_ETH1SR_ETH1_TX_CLK_GATING_CTRL_Msk                          (0x1UL << SYSCFG_ETH1SR_ETH1_TX_CLK_GATING_CTRL_Pos)                            /*!< 0x00000001 */
#define SYSCFG_ETH1SR_ETH1_TX_CLK_GATING_CTRL                              SYSCFG_ETH1SR_ETH1_TX_CLK_GATING_CTRL_Msk                                      /*!< Asserted when the MAC has entered Tx LPI mode */
#define SYSCFG_ETH1SR_ETH1_PWR_DOWN_ACK_Pos                                (1U)
#define SYSCFG_ETH1SR_ETH1_PWR_DOWN_ACK_Msk                                (0x1UL << SYSCFG_ETH1SR_ETH1_PWR_DOWN_ACK_Pos)                                  /*!< 0x00000002 */
#define SYSCFG_ETH1SR_ETH1_PWR_DOWN_ACK                                    SYSCFG_ETH1SR_ETH1_PWR_DOWN_ACK_Msk                                            /*!< Asserted when the power-down sequence start has been acknowledged */

/****************  Bit definition for SYSCFG_ETH2CR register  *****************/
#define SYSCFG_ETH2CR_ETH2_REF_CLK_SEL_Pos                                 (0U)
#define SYSCFG_ETH2CR_ETH2_REF_CLK_SEL_Msk                                 (0x1UL << SYSCFG_ETH2CR_ETH2_REF_CLK_SEL_Pos)                                   /*!< 0x00000001 */
#define SYSCFG_ETH2CR_ETH2_REF_CLK_SEL                                     SYSCFG_ETH2CR_ETH2_REF_CLK_SEL_Msk                                             /*!< Reference/RX clock selection */
#define SYSCFG_ETH2CR_ETH2_CLK_SEL_Pos                                     (1U)
#define SYSCFG_ETH2CR_ETH2_CLK_SEL_Msk                                     (0x1UL << SYSCFG_ETH2CR_ETH2_CLK_SEL_Pos)                                       /*!< 0x00000002 */
#define SYSCFG_ETH2CR_ETH2_CLK_SEL                                         SYSCFG_ETH2CR_ETH2_CLK_SEL_Msk                                                 /*!< RGMII 125MHz clock selection */
#define SYSCFG_ETH2CR_ETH2_PTP_CLK_SEL_Pos                                 (2U)
#define SYSCFG_ETH2CR_ETH2_PTP_CLK_SEL_Msk                                 (0x1UL << SYSCFG_ETH2CR_ETH2_PTP_CLK_SEL_Pos)                                   /*!< 0x00000004 */
#define SYSCFG_ETH2CR_ETH2_PTP_CLK_SEL                                     SYSCFG_ETH2CR_ETH2_PTP_CLK_SEL_Msk                                             /*!< PTP (IEEE1588) clock selection */
#define SYSCFG_ETH2CR_ETH2_SEL_Pos                                         (4U)
#define SYSCFG_ETH2CR_ETH2_SEL_Msk                                         (0x7UL << SYSCFG_ETH2CR_ETH2_SEL_Pos)                                           /*!< 0x00000070 */
#define SYSCFG_ETH2CR_ETH2_SEL                                             SYSCFG_ETH2CR_ETH2_SEL_Msk                                                     /*!< Ethernet 2 PHY interface selection */

/****************  Bit definition for SYSCFG_ETH2SR register  *****************/
#define SYSCFG_ETH2SR_ETH2_TX_CLK_GATING_CTRL_Pos                          (0U)
#define SYSCFG_ETH2SR_ETH2_TX_CLK_GATING_CTRL_Msk                          (0x1UL << SYSCFG_ETH2SR_ETH2_TX_CLK_GATING_CTRL_Pos)                            /*!< 0x00000001 */
#define SYSCFG_ETH2SR_ETH2_TX_CLK_GATING_CTRL                              SYSCFG_ETH2SR_ETH2_TX_CLK_GATING_CTRL_Msk                                      /*!< Asserted when the MAC has entered Tx LPI mode */
#define SYSCFG_ETH2SR_ETH2_PWR_DOWN_ACK_Pos                                (1U)
#define SYSCFG_ETH2SR_ETH2_PWR_DOWN_ACK_Msk                                (0x1UL << SYSCFG_ETH2SR_ETH2_PWR_DOWN_ACK_Pos)                                  /*!< 0x00000002 */
#define SYSCFG_ETH2SR_ETH2_PWR_DOWN_ACK                                    SYSCFG_ETH2SR_ETH2_PWR_DOWN_ACK_Msk                                            /*!< Asserted when the power-down sequence start has been acknowledged */

/****************  Bit definition for SYSCFG_ETHSWCR register  ****************/
#define SYSCFG_ETHSWCR_ETH1_DIRECT_Pos                                     (0U)
#define SYSCFG_ETHSWCR_ETH1_DIRECT_Msk                                     (0x1UL << SYSCFG_ETHSWCR_ETH1_DIRECT_Pos)                                       /*!< 0x00000001 */
#define SYSCFG_ETHSWCR_ETH1_DIRECT                                         SYSCFG_ETHSWCR_ETH1_DIRECT_Msk                                                 /*!< This bit allow to bypass the Ethernet switch */
#define SYSCFG_ETHSWCR_ETHSW_CFG_IF_SEL_Pos                                (1U)
#define SYSCFG_ETHSWCR_ETHSW_CFG_IF_SEL_Msk                                (0x1UL << SYSCFG_ETHSWCR_ETHSW_CFG_IF_SEL_Pos)                                  /*!< 0x00000002 */
#define SYSCFG_ETHSWCR_ETHSW_CFG_IF_SEL                                    SYSCFG_ETHSWCR_ETHSW_CFG_IF_SEL_Msk                                            /*!< Select PHY interface type for external ports */
#define SYSCFG_ETHSWCR_ETHSW_CLK_SEL_Pos                                   (2U)
#define SYSCFG_ETHSWCR_ETHSW_CLK_SEL_Msk                                   (0x1UL << SYSCFG_ETHSWCR_ETHSW_CLK_SEL_Pos)                                     /*!< 0x00000004 */
#define SYSCFG_ETHSWCR_ETHSW_CLK_SEL                                       SYSCFG_ETHSWCR_ETHSW_CLK_SEL_Msk                                               /*!< Select clock source for 125 MHz */
#define SYSCFG_ETHSWCR_ETHSW_REF_SEL_Pos                                   (3U)
#define SYSCFG_ETHSWCR_ETHSW_REF_SEL_Msk                                   (0x1UL << SYSCFG_ETHSWCR_ETHSW_REF_SEL_Pos)                                     /*!< 0x00000008 */
#define SYSCFG_ETHSWCR_ETHSW_REF_SEL                                       SYSCFG_ETHSWCR_ETHSW_REF_SEL_Msk                                               /*!< Select clock source for RMII 50MHz */

/**************  Bit definition for SYSCFG_VDDIO3CCCR register  ***************/
#define SYSCFG_VDDIO3CCCR_RANSRC_Pos                                       (0U)
#define SYSCFG_VDDIO3CCCR_RANSRC_Msk                                       (0xFUL << SYSCFG_VDDIO3CCCR_RANSRC_Pos)                                         /*!< 0x0000000F */
#define SYSCFG_VDDIO3CCCR_RANSRC                                           SYSCFG_VDDIO3CCCR_RANSRC_Msk                                                   /*!< NMOS compensation code of the I/Os supplied by VDDIO3 */
#define SYSCFG_VDDIO3CCCR_RAPSRC_Pos                                       (4U)
#define SYSCFG_VDDIO3CCCR_RAPSRC_Msk                                       (0xFUL << SYSCFG_VDDIO3CCCR_RAPSRC_Pos)                                         /*!< 0x000000F0 */
#define SYSCFG_VDDIO3CCCR_RAPSRC                                           SYSCFG_VDDIO3CCCR_RAPSRC_Msk                                                   /*!< PMOS compensation code of the I/Os supplied by VDDIO3 */
#define SYSCFG_VDDIO3CCCR_EN_Pos                                           (8U)
#define SYSCFG_VDDIO3CCCR_EN_Msk                                           (0x1UL << SYSCFG_VDDIO3CCCR_EN_Pos)                                             /*!< 0x00000100 */
#define SYSCFG_VDDIO3CCCR_EN                                               SYSCFG_VDDIO3CCCR_EN_Msk                                                       /*!< VDDIO3 I/Os compensation cell enable */
#define SYSCFG_VDDIO3CCCR_CS_Pos                                           (9U)
#define SYSCFG_VDDIO3CCCR_CS_Msk                                           (0x1UL << SYSCFG_VDDIO3CCCR_CS_Pos)                                             /*!< 0x00000200 */
#define SYSCFG_VDDIO3CCCR_CS                                               SYSCFG_VDDIO3CCCR_CS_Msk                                                       /*!< VDDIO3 I/Os code selection */

/**************  Bit definition for SYSCFG_VDDIO3CCSR register  ***************/
#define SYSCFG_VDDIO3CCSR_ANSRC_Pos                                        (0U)
#define SYSCFG_VDDIO3CCSR_ANSRC_Msk                                        (0xFUL << SYSCFG_VDDIO3CCSR_ANSRC_Pos)                                          /*!< 0x0000000F */
#define SYSCFG_VDDIO3CCSR_ANSRC                                            SYSCFG_VDDIO3CCSR_ANSRC_Msk                                                    /*!< NMOS compensation value of the I/Os supplied by VDDIO3 */
#define SYSCFG_VDDIO3CCSR_APSRC_Pos                                        (4U)
#define SYSCFG_VDDIO3CCSR_APSRC_Msk                                        (0xFUL << SYSCFG_VDDIO3CCSR_APSRC_Pos)                                          /*!< 0x000000F0 */
#define SYSCFG_VDDIO3CCSR_APSRC                                            SYSCFG_VDDIO3CCSR_APSRC_Msk                                                    /*!< PMOS compensation value of the I/Os supplied by VDDIO3 */
#define SYSCFG_VDDIO3CCSR_READY_Pos                                        (8U)
#define SYSCFG_VDDIO3CCSR_READY_Msk                                        (0x1UL << SYSCFG_VDDIO3CCSR_READY_Pos)                                          /*!< 0x00000100 */
#define SYSCFG_VDDIO3CCSR_READY                                            SYSCFG_VDDIO3CCSR_READY_Msk                                                    /*!< VDDIO3 I/Os compensation cell ready flag */

