STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231dxx_cm33.h
/**************** TIM Instances : external trigger input available ************/
#define IS_TIM_ETR_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                            ((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                            ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                            ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS)  || \
                                            ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS)  || \
                                            ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS))

/************* TIM Instances : supporting ETR source selection ***************/
#define IS_TIM_ETRSEL_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                             ((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                             ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                             ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS)  || \
                                             ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS)  || \
                                             ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS))

/****** TIM Instances : Master mode available (TIMx_CR2.MMS available )********/
#define IS_TIM_MASTER_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                            ((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                            ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                            ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS)  || \
                                            ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS)  || \
                                            ((INSTANCE) == TIM6_S)  || ((INSTANCE) == TIM6_NS)  || \
                                            ((INSTANCE) == TIM7_S)  || ((INSTANCE) == TIM7_NS)  || \
                                            ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS)  || \
                                            ((INSTANCE) == TIM12_S) || ((INSTANCE) == TIM12_NS) || \
                                            ((INSTANCE) == TIM15_S) || ((INSTANCE) == TIM15_NS))

/*********** TIM Instances : Slave mode available (TIMx_SMCR available )*******/
#define IS_TIM_SLAVE_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                            ((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                            ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                            ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS)  || \
                                            ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS)  || \
                                            ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS)  || \
                                            ((INSTANCE) == TIM12_S) || ((INSTANCE) == TIM12_NS) || \
                                            ((INSTANCE) == TIM15_S) || ((INSTANCE) == TIM15_NS))

/****************** TIM Instances : supporting OCxREF clear *******************/
#define IS_TIM_OCXREF_CLEAR_INSTANCE(INSTANCE)        (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                                       ((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                                       ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                                       ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS)  || \
                                                       ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS)  || \
                                                       ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS))

/****************** TIM Instances : remapping capability **********************/
#define IS_TIM_REMAP_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                            ((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                            ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                            ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS)  || \
                                            ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS)  || \
                                            ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS))

/****************** TIM Instances : supporting repetition counter *************/
#define IS_TIM_REPETITION_COUNTER_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                                       ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS)  || \
                                                       ((INSTANCE) == TIM15_S) || ((INSTANCE) == TIM15_NS) || \
                                                       ((INSTANCE) == TIM16_S) || ((INSTANCE) == TIM16_NS) || \
                                                       ((INSTANCE) == TIM17_S) || ((INSTANCE) == TIM17_NS))

/****************** TIM Instances : supporting synchronization ****************/
#define IS_TIM_SYNCHRO_INSTANCE(INSTANCE)  IS_TIM_MASTER_INSTANCE(INSTANCE)

/****************** TIM Instances : supporting ADC triggering through TRGO2 ***/
#define IS_TIM_TRGO2_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS) || \
                                            ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS))

/******************* TIM Instances : Timer input XOR function *****************/
#define IS_TIM_XOR_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                            ((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                            ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                            ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS)  || \
                                            ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS)  || \
                                            ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS)  || \
                                            ((INSTANCE) == TIM12_S) || ((INSTANCE) == TIM12_NS) || \
                                            ((INSTANCE) == TIM15_S) || ((INSTANCE) == TIM15_NS))

